Model: "sequential_19"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
bidirectional_19 (Bidirectio (None, 128)               29952     
_________________________________________________________________
dropout_19 (Dropout)         (None, 128)               0         
_________________________________________________________________
dense_38 (Dense)             (None, 16)                2064      
_________________________________________________________________
dense_39 (Dense)             (None, 1)                 17        
=================================================================
Total params: 32,033
Trainable params: 32,033
Non-trainable params: 0
_________________________________________________________________
