Model: "sequential_3"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
bidirectional_3 (Bidirection (None, 101, 128)          29952     
_________________________________________________________________
bidirectional_4 (Bidirection (None, 64)                31104     
_________________________________________________________________
dropout_3 (Dropout)          (None, 64)                0         
_________________________________________________________________
dense_6 (Dense)              (None, 16)                1040      
_________________________________________________________________
dense_7 (Dense)              (None, 1)                 17        
=================================================================
Total params: 62,113
Trainable params: 62,113
Non-trainable params: 0
_________________________________________________________________
