Model: "sequential_23"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
gru_21 (GRU)                 (None, 64)                14976     
_________________________________________________________________
dropout_23 (Dropout)         (None, 64)                0         
_________________________________________________________________
dense_46 (Dense)             (None, 16)                1040      
_________________________________________________________________
dense_47 (Dense)             (None, 1)                 17        
=================================================================
Total params: 16,033
Trainable params: 16,033
Non-trainable params: 0
_________________________________________________________________
