Model: "sequential_24"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_2 (LSTM)                (None, 64)                19712     
_________________________________________________________________
dropout_24 (Dropout)         (None, 64)                0         
_________________________________________________________________
dense_48 (Dense)             (None, 16)                1040      
_________________________________________________________________
dense_49 (Dense)             (None, 1)                 17        
=================================================================
Total params: 20,769
Trainable params: 20,769
Non-trainable params: 0
_________________________________________________________________
