Model: "sequential_18"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
bidirectional_18 (Bidirectio (None, 128)               29952     
_________________________________________________________________
dropout_18 (Dropout)         (None, 128)               0         
_________________________________________________________________
dense_36 (Dense)             (None, 16)                2064      
_________________________________________________________________
dense_37 (Dense)             (None, 1)                 17        
=================================================================
Total params: 32,033
Trainable params: 32,033
Non-trainable params: 0
_________________________________________________________________
