Model: "sequential_10"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
bidirectional_10 (Bidirectio (None, 128)               29952     
_________________________________________________________________
dropout_10 (Dropout)         (None, 128)               0         
_________________________________________________________________
dense_20 (Dense)             (None, 16)                2064      
_________________________________________________________________
dense_21 (Dense)             (None, 1)                 17        
=================================================================
Total params: 32,033
Trainable params: 32,033
Non-trainable params: 0
_________________________________________________________________
