Model: "sequential_22"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_1 (LSTM)                (None, 64)                19712     
_________________________________________________________________
dropout_22 (Dropout)         (None, 64)                0         
_________________________________________________________________
dense_44 (Dense)             (None, 16)                1040      
_________________________________________________________________
dense_45 (Dense)             (None, 1)                 17        
=================================================================
Total params: 20,769
Trainable params: 20,769
Non-trainable params: 0
_________________________________________________________________
