Model: "sequential_20"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
bidirectional_17 (Bidirectio (None, 128)               29952     
_________________________________________________________________
dense_57 (Dense)             (None, 32)                4128      
_________________________________________________________________
dense_58 (Dense)             (None, 1)                 33        
=================================================================
Total params: 34,113
Trainable params: 34,113
Non-trainable params: 0
_________________________________________________________________
